import math

#=======================================================================
#task 15
#=======================================================================
#Написать функцию, которая отвечает на вопрос,
#пересекаются ли две заданные окружности на плоскости.
#Каждая окружность задается координатами центра и радиусом.

def intersection_circles(x1, y1, r1, x2, y2, r2):
    d = math.sqrt((x2 - x1)**2 + (y2 - y1)**2)
    if d <= r1 + r2:
        if abs(r2 - r1) > d:
            return False
        else:
            return True
    else:
        return False

example = intersection_circles(22, 61, 42, -61, 23, 99)
print(example)

