
#=================================================================================================================
#task one:
#Преобразовать строку с американским форматом даты в европейский.

american_variant = '3.27.2017'
lst = american_variant.split('.')
european_variant = '%s.%s.%s' % (lst[1], lst[0], lst[2])
print(european_variant)


#=================================================================================================================
#task two:
#Написать программу, которая преобразует имя студента, ставя фамилию на первое место, а имя на второе.

name_surname = 'Archi Dyadushka'
lst = name_surname.split(' ')
surname_name = '%s %s' % (lst[1], lst[0])
print(surname_name)


#=================================================================================================================
#task three:
#Написать программу, которая преобразует имя переменной в формате snake_style в формат CamelizedStyle

snake_style = 'Because_I\'m_Batman'
lst = snake_style.split('_')
camelized = '%s%s%s' % (lst[0], lst[1], lst[2])
print(camelized)
# !!! Я вот не понял, как сделать, если у нас в Снэйк_стиле слова с маленькой буквы начинаются.
#  И еще интересно, если наоборот переводить из Камелайзд в Снэйк, то разделение Сплит будет по заглавным буквам что ли?


#=================================================================================================================
#task four:
#Требуется написать программу, которая по переданной строке определит возраст писателя и вернет его имя и возраст.

first_date = 'Charles Dickens*1812-07-02*1870-09-07'
lst = first_date.split('*')
name = '%s' % (lst[0])
birth_day = lst[1]
death_day = lst[2]

lst = birth_day.split('-')
birth_year = lst[0]

lst = death_day.split('-')
death_year = lst[0]

age = int(death_year) - int(birth_year)
result = '%s, %d' % (name, age)
print(result)
