import math

#==============================================================================
#task 14
#==============================================================================
#Написать функцию, которая будет проверять четность некоторого числа.


def parity(number):
    return math.fmod(number, 2) == 0


example = parity(42.2)
print(example)

